tutorials/FE30_32/wavemakerFlume/0.org/pointDisplacement_piston
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            fixedValue; 
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            wavemakerMovement;
        wavemakerDictName wavemakerMovementDict;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
